#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
data.azurerm_client_config.current: Reading...
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
azurerm_cognitive_account.LangChain_Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.CognitiveServices/accounts/LangChain-Experiments]
azurerm_key_vault.slackbot_secrets: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_key_vault_secret.slackbot_redis_hostname: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/0151f4fe9f2945ff967147d2d3e6544c]
azurerm_key_vault_secret.slackbot_synth_endpoint: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-endpoint/2452d172c1e2463bac31c9d173be3e68]
azurerm_key_vault_secret.slackbot_synth_primary_access_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/slackbot-synth-primary-access-key/e773f33f5992439580f3778c37256365]
azurerm_key_vault_secret.slackbot_redis_key: Refreshing state... [id=https://slackbot-secrets.vault.azure.net/secrets/redis-key/2aa0594d6d484fc2828cc08d547895fc]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cognitive_account.slackbot_azure_cogservices will be created
  + resource "azurerm_cognitive_account" "slackbot_azure_cogservices" {
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "Bing.Search.v7"
      + local_auth_enabled                 = true
      + location                           = "global"
      + name                               = "Slackbot-CogServices"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "LangChain-Experiments"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "F0"
    }

  # azurerm_key_vault_secret.slackbot_azure_cogservices_key will be created
  + resource "azurerm_key_vault_secret" "slackbot_azure_cogservices_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.KeyVault/vaults/slackbot-secrets"
      + name                    = "cogservices-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.slackbot_redis_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "slackbot_redis_key" {
        id                      = "https://slackbot-secrets.vault.azure.net/secrets/redis-key/2aa0594d6d484fc2828cc08d547895fc"
        name                    = "redis-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*